{
    "meta": {
        "dataObjects": 4,
        "created": "08-15-2023",
        "updated": "08-15-2023"
    },

    "data": [
        {
            "title": "1878-1938",
            "text": "It is believed that Manchester Baptist Church was organized in someone’s home in 1878. Green Clay Smith was the first pastor. He came to Manchester from the town of Richmond in Madison County, KY.<br><br> On July 3, 1882, David L. Little and Ellen C. Little sold a lot for the first church building to Gilbert Garrard and William J. Caudill, trustees, and the successors in perpetuity. The first Manchester Baptist Church building was located at 105 Little Street. This building was a frame house with a solid foundation of native stone. the Weatherboarding and studs were cut of native virgin yellow poplar. The floors were native oak and the walls were plaster. The building was one room, 52′ by 30′, and a small vestibule 10′ by 8′. Members of the church donated the material. Labor was donated by William Caudill and William Baker.<br><br> Members came to Sunday School and the Worship Service by horseback, buggies, and wagons. The average attendance was 30-35. Sunday School classes met in the corners of the building with Gilbert Garrard, Mrs. Nancy Potter, Mrs. Marshall House, and Professor Joe Martin as teachers.<br><br> Other pastors served in the following order: John W. Morgan, W.B. Estus, Joseph Parsons, Robert Lee Baker, Leander Clause, William Hainsworth, James Anderson Burns, and Henry R. McLenndon. Pastors became harder to find and the attendance dropped off, so the Baptist, Christian, and Presbyterian churches began meeting together. The three church bodies met in the Christian Church building and the Presbyterian pastor, Brother Forsyth, did the preaching. This continued from 1911 until 1915. During these four years, the small Manchester Baptist Church building began to fall apart. Windows and shutters were all broken and gone, and the roof rotted. Community children wouldn’t play near it; they called it “the ghost house.”<br><br> Britt Lyttle, a devout charter member, wrote to the Secretary of the State Board of Kentucky Baptists, Dr. W.O. Powell and asked for help. In July 1914, Dr. Powell sent F.R. Walters from Corbin. It took him twelve hours to make the trip in a buggy (a 45-minute drive today). He preached at the Presbyterian Church for two services. A special meeting was held and it was decided that the Baptist believers needed to go back to their own church building, repair it, and make a new start. Work started immediately. Brother Walters promised to come as often as he could to preach.<br><br> The Church called Rev. F.R. Walters as pastor in the fall of 1917. Manchester Baptist Church and the State Board of Kentucky Baptists jointly supported him as full-time pastor of the Church and as a mission worker. He worked with other churches in Clay and Jackson Counties. The Sunday School grew and Lloyd Walker was elected Sunday School Superintendent. Later, Dr. J.L. Anderson, Lloyd Walker, Dr. David L. Walker, Dr. M.F. Porter, and John A. Webb were elected and ordained as deacons.<br><br> Brother Walters used the Southern Baptist Program in organizing the Sunday School and Training Union. Mrs. Walters was a leader in organizing the Women’s Missionary Union. The church grew rapidly and in 1918 an addition was added to the building. As the church grew, more deacons were ordained. They were Bige Hensley, Stephen Keith Jr., Francis Walters, J.C. Webb, Joe Tigue, Ben Rice, and Bruce Dezarn."
        },
        
        {
            "title": "1939-1966",
            "text": "In 1939 the church voted unanimously for a new church building. Elbert S. Langdon, Joe Tigue, William Marcum, Jim Webb, and Henry Comm were appointed to a committee for raising funds. The building committee consisted of John A. Webb, Francis Walters, Dr. J.L. Anderson, Willie Rice, Stephen Keith Jr., Jim Webb, Bige Hensley, and Ted Marcum. A lot adjacent to the Clay County Courthouse was purchased on April 7, 1940 from G.G. Burchell for $2,600.<br><br> In 1949, the lot was paid for and the building fund was $30,000. After a trip to Campbellsville, the members decided to use the same building plans as Campbellsville Baptist Church, only larger. An architect with the Baptist Sunday School Board assisted with the plans. The building committee supervised the work and no contracts were let.<br><br> On July 3, 1949 a groundbreaking ceremony was held. In October 1950, a corner stone service was held and a brief history of the church was placed in 404114 the corner stone. On October 8, 1950, the old Manchester Baptist Church building was sold to the Manchester Masonic Lodge Number 794 for $5,010. The church held its last meeting there on October 29, 1950. The members met in the basement of the new church until May 1951 when services were held in the new auditorium. On September 7, 1952 an all day service for the dedication of The Home of Manchester Baptist Church was held. The exact wording of the dedication taken from a printed order of service reads as follows, “This the 7th day of September, 1952 brings us together to dedicate the lot, the building and all its furnishings to our Lord. With good supervision and economy we have this plant at a cost of $100,000, and free from debt. Therefore we join in heart and love to say we, the Manchester Baptist Church, now in regular service, do hereby give and dedicate, this entire plant unto our Lord and His Son, Jesus Christ, for the purpose of teaching and preaching the faith of the scripture as held now by this church, which is in full accord with the General Association of Kentucky Baptist, and to the worship of God as long as time may permit it’s use. To be used only for divine worship and services, which are for His glory and advancement of His Kingdom. All services free and no charge to be made for any gathering or meeting within its walls.” The Dedication Prayer was led by J.L. Tigue, continued by Frances Walters, and closed by Steve Keith. The choir sang “All Hail.” The morning message was delivered by Rev. Gifford Walters and the afternoon message by Rev. D Chester Sparks. Prayers were also led by Ralph Peters and Jim Langdon.<br><br> On August 19, 1961, several families from Manchester Baptist Church were commissioned and sent to form Lyttleton Baptist Church in nearby Lyttleton, KY.<br><br> On April 3, 1966 Manchester Baptist Church honored their beloved pastor with a “F.R. Walters Day.” Brother Walters talked about some of his experiences throughout the many years of his ministry. He went to be with the Lord on February 11, 1970."
        },
        
        {
            "title": "1967-2002",
            "text": "Others serving as pastor of Manchester Baptist Church have been I. Huston Lanier (1967-1970), Maurice Barnes (1970-79), Dana Boatman (1980-81), and Roger Williams (1982-89). Some very distinguished preachers and educators served as interim pastor including Dr. H.C. Chiles, Dr. George Redding and Robert Oldham. Kenneth Bolin Jr. was called to Manchester Baptist Church in October 1990 and continues to serve as lead pastor. He and his wife, Carol, were both Baptist Preacher’s Kids. Bro. Ken and his family are loved and respected by the church members and others throughout Clay County.<br><br> Other Deacons who have served in the past were: Ted Riddle, E.S. Langdon, John A. Webb, Ralph Peters, Estill Hensley, Henry Corum, Bill Edwards, Saul Goins, Monroe Garrison, and Eddie Dobson.<br><br> Music and youth leaders were added to the staff. Serving in that position have been Keith Morrow, David Gregory, P.D. Hensley, Jack McCarty, David Hale, Patricia Eubank, Gene Cornett, Will Langford, Ergun Caner, Luther Allen, Shannon Harter, Kevin Rice, Randy Schmittendorf and Dusty Grubb.<br><br> Billie Feltner served as church organist for many years. She assisted with numerous Christmas and Easter Cantatas and other special presentations. She worked with many different choir directors and choir members to bless the congregation with special music throughout the years. Mrs. Billie went to be with the Lord in 2011. In addition to the ones listed above, some who have served as pianists have been Mrs. F.R Walters, Ann Hoskins, Patricia Schmittendorf, and Pat Williams. Some of the choir directors other than the ones already listed have been Tara Rominger, Lori Lunsford, and Linda Dobson.<br><br> Manchester Baptist Church has from its beginning promoted Missions at home and throughout the world. The WMU and Brotherhood have had some great leaders. In addition to their study about missions and carrying out mission work in the community, they have encouraged and supported the Children’s mission groups, including Mission Friends, G.A.s, Acteens and R.A.s. In 1963 Lyttleton Baptist Church was organized as a mission of Manchester Baptist Church. Some who went to work in that mission were, Ben Rice, Ted Robinson, Ernest Rice, Bruce Dezarn and Lawanna Owens.<br><br> Manchester Baptist Church has undergone several building and/or renovation projects. In 1967, the Lewis property was purchased in East Manchester to be used as a parsonage. In 1980 a complete renovation of the sanctuary was completed. Carpet, lighting, and a new baptistery were installed. The ceiling was lowered for the purpose of cutting down on the cost of cooling and heating. In 1983, a fourth level was added which included space for Sunday School and mission group activities. The bell from the old Manchester Baptist Church was installed above the new rooms. In 1984, Mae Corum purchased an Allen Organ as a memorial to her late husband, Henry F. Corum. The old organ was given to the Oneida Baptist Church. Also in 1984, the Joe and Nannie Tigue property, which consisted of the main house, a smaller house, office building, and garage was purchased by the church for $150,000. This purchase made it possible for the pastor’s residence and study to be next door to the church. The property in East Manchester was sold.<br><br> In 1988 construction began on a multi-purpose education/recreation building. This provided much needed space for Sunday School classes as well as a gymnasium and walking track. The building was completed in 1989 at a cost of $385,000. A dedication service was held and the building was named the “Ed Building” taken from Joshua 22:34.<br><br> In 1990 a cover for the front entrance was built and the steps were repaired and tiled. In 1993 stained glass windows were purchased from Statesville Stained Glass, depicting the life of Christ from His birth to His ascension. Individual donors purchased the windows as memorials to their loved ones. Total cost of the project was $30,000. Also in 1993 the floors in the front foyer were refinished and the foyer was completely redecorated with new furniture, mirrors, rugs, and accessories. Later in 1993 the pulpit area was enlarged and rounded, with steps around the full length so one can enter or exit the pulpit from any angle. Frank Brown, a trustee of the Church, planned and constructed the new addition and did the finishing work in the foyer. The foyer area was dedicated to Frank and Arlo Brown for their labor. In 1998 the parsonage was completely renovated. Jim Short did the carpentry work.<br><br> In 1999 the Church kitchen was completely renovated with new cabinets, appliances, pantry and tiled floor. The kitchen was dedicated to Squire Baker and Maude Keith for their financial support. Then in the year 2000 the Pastor’s study was converted to a beautiful nursery which was named, the Saul Goins Nursery. The Pastor’s study was moved to the fourth level of the main church building and became known as the Upper Room.<br><br> Manchester Baptist Church quit having the Baptist Training Union Program in the 1970s, but continued to have a strong Sunday School Program, Vacation Bible School, Mission Groups for all ages, and other educational opportunities.<br><br> In an effort to reach all people, the Sunday evening services, beginning in August, 2001, were led by a Contemporary Praise Team, with short skits to help illustrate the messages delivered by Pastor Bolin and Dr. Terry Bryant. This program was designed to help all age groups in using the Bible to deal with everyday issues. The first praise team was made up of Todd Hollen, Allen Roberts, Kenneth Allen Bolin, Cecil Smith, Betty Bishop, Amanda Bolin, Justin Hollen, Charles Ray Hubbard, Carol Bolin, and Marty Hacker. The name given to the service was L.I.F.E for the “Lord’s Invitation For Everyone.”<br><br> A ministry team was formed in 2002 to assist the pastor in five areas; Worship, Missions, Stewardship, Education, and Pastoral Care. All members of the church were encouraged to be a part of one or more of these ministries with a common goal, “To Know Christ and To Make Him Known.”"
        },
        
        {
            "title": "2003-Present",
            "text": "In October, 2009, the church hired Jimmy Dezarn as part-time youth minister and Ryan Cornett as part-time children’s minister. In 2011, Allen Roberts was installed as Assistant Pastor. In January, 2017, Carl Varney was hired as part-time student minister to combine both the children’s and youth ministry.<br><br> In August, 2018, Allen Roberts was installed as pastor of our sister church, Lyttleton Baptist Church.<br><br> In October, 2018, three men presented themselves as candidates for the office of elder: John Rice, the Chairperson of the deacons at the time, Carl Varney, and Ryan Cornett. In April, 2019, they were publicly examined and unanimously approved for installation by the church. In 2019, John Hensley and Brian Lewis were ordained as deacons.<br><br> In February, 2020, in a regular business meeting the church voted to appoint Pastor Ryan Cornett as choir leader.<br><br> In late March 2020, MBC suspended in-person indoor services due to the COVID-19 pandemic. Over the next several months, the church would meet via drive-in services outside the Clay County Community Center (Crawdad Building) in the parking lot. Sunday and Wednesday evening services were suspended, and resumed shortly thereafter as virtual meetings using Zoom and Facebook Live.<br><br> On Sunday, August 1, 2021, the church sent out elder Carl Varney and his family with tears and love. Carl and his family moved to Richmond, KY. The church blessed Carl and his family as they would live and serve there.<br><br> On Wednesday, September 1, 2021, the church unanimously approved elder Ryan Cornett as her assistant pastor in an unprecedented vote-by-internet-message necessitated by a surging COVID-19 outbreak in Clay County.<br><br> In early 2023, Jimmy Dezarn and Fred Rogers were ordained as deacons. The following deacons also currently serve: Charles Goins, Butch Grubb, Mike Baker, Larry Day, Donnie Hacker, Charles D. Keith, and Brian Lewis."
        }
    ]
}
